/**
 *  লাইন বাই লাইন ব্যাখ্যা:
let num = 1;
→ num নামের একটি ভেরিয়েবল তৈরি করা হয়েছে যার শুরুতে মান ১।

while (num <= 10)
→ এই লুপটি চলবে যতক্ষণ num এর মান ১০ অথবা তার চেয়ে কম থাকবে।

console.log(num);
→ প্রতিবার লুপে num এর বর্তমান মান প্রিন্ট করবে।

if (num % 2 === 0)
→ চেক করা হচ্ছে num জোড় (even) কিনা।
→ % হল মডুলাস অপারেটর, যা ভাগশেষ দেয়।
→ যদি num % 2 এর ফলাফল ০ হয়, তাহলে সেটা জোড় সংখ্যা।

console.log('even number', num);
→ যদি num জোড় হয়, তাহলে এটি আলাদাভাবে "even number" লিখে প্রিন্ট করবে।

num++;
→ num এর মান ১ করে বাড়ানো হচ্ছে যেন লুপ এগিয়ে যায়।

সারাংশ:
এই লুপটি ১ থেকে ১০ পর্যন্ত সব সংখ্যা প্রিন্ট করে এবং যদি সংখ্যা even (জোড়) হয়, তাহলে সেটা "even number" হিসেবে আলাদাভাবে দেখায়।
 */

let num = 1;
while (num <= 10){
    console.log(num);
    if (num % 2 === 0){
        console.log('even number', num);
    }
    num++;
}