/**
 *  লাইন বাই লাইন ব্যাখ্যা:
let num = 1;
এখানে num নামে একটা ভেরিয়েবল তৈরি করা হয়েছে যার শুরুতে মান ১।

let sum = 0;
এখানে sum নামে আরেকটা ভেরিয়েবল রাখা হয়েছে, যেটা শুরুতে ০। এটা ব্যবহার করা হচ্ছে মোট যোগফল হিসেব করার জন্য।

while (num <= 10)
লুপটা চলবে যতক্ষণ num এর মান ১০ অথবা তার চেয়ে কম থাকবে।



লুপের ভিতরের কাজগুলো:
প্রতিবার লুপ চললে:

num প্রিন্ট হবে

sum = sum + num → আগের sum এর সাথে নতুন num যোগ হবে

নতুন sum প্রিন্ট হবে

তারপর num++ → num এর মান ১ করে বাড়বে



শেষ কথা:
এই লুপটি ১ থেকে ১০ পর্যন্ত সব সংখ্যা প্রিন্ট করে এবং সেই সাথে প্রতি ধাপে মোট যোগফল হিসেব করে দেখায়।
শেষে sum এর মান দাঁড়ায়: 55
 */




let num = 1;
let sum = 0;
while (num <= 10) {
    console.log(num);
    sum = sum + num;
    console.log('Sum', sum);
    num++;
}